# 1. 使用print输出自己的姓名
print("马梦利")

# 间隔线
print("----------------------")

# 2. 使用print输出
#    春眠不觉晓，
#    出处闻啼鸟，
#    夜来风雨声，
#    花落知多少。
#方法一
print("春眠不觉晓，")
print("出处闻啼鸟，")
print("夜来风雨声，")
print("花落知多少。")

#方法一和二的间隔线
print("----------------------")
#方法二
print('''春眠不觉晓，
出处闻啼鸟，
夜来风雨声，
花落知多少。
''')

# 3. 是用print输出
#    春眠不觉晓，出处闻啼鸟，夜来风雨声，花落知多少。
#方法一
print("春眠不觉晓，", end="")
print("出处闻啼鸟，", end="")
print("夜来风雨声，", end="")
print("花落知多少。")
#方法一和二的间隔线
print("----------------------")
#方法二
print("春眠不觉晓，出处闻啼鸟，夜来风雨声，花落知多少。")