print("6" + "9")
# 间隔线
print("----------------------")
print(int("6") + int("9"))
# 间隔线
print("1----------------------")
# 1. 计算整型50乘以10再除以5的商并使用print输出。
print(50 * 10 / 5)
# 间隔线
print("2----------------------")
# 2. 判断整型8是否大于10的结果并使用print输出。
print(8 > 10)
# 间隔线
print("3----------------------")
# 3. 计算整型30除以2得到的余数并使用print输出。
print(30 % 2)
# 间隔线
print("4----------------------")
# 4. 使用字符串乘法实现 把字符串”我爱我的祖国”创建三遍并拼接起来最终使用print输出。
print(3 * "我爱我的祖国")
# 间隔线
print("5----------------------")
# 5. 判断 字符串”wupeiqi”和”alex”是否相等的结果并使用print输出。
print("wupeiqi" == "alex")
# 间隔线
print("6----------------------")
# 6. 判断 整型666和整型666是否相等的结果并使用print输出。
print(666 == 666)
# 间隔线
print("7----------------------")
# 7. 判断 字符串”666”和整型666是否相等的结果并使用print输出。
print(str(666) == 666)

# 间隔线
print("8----------------------")
print( int("100")*3 )
print( int("123") + int("88") )
print( str(111) + str(222) )
print( str(111)*3 )
print( int("8") > 7 )
print( str(111) == 111 )
print( bool(-1) )
print( bool(0) )
print( bool("") )
print( bool("你好") )
print( True == True)
print( True == False)
print( bool("") == bool(0) )